Revit 2027 API
UIDocument.GetSketchGalleryOptions Method
 Gets the valid sketch gallery options of a family symbol.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<SketchGalleryOptions> GetSketchGalleryOptions(
	FamilySymbol familySymbol
)
Public Function GetSketchGalleryOptions (
	familySymbol As FamilySymbol
) As IList(Of SketchGalleryOptions)
public:
IList<SketchGalleryOptions>^ GetSketchGalleryOptions(
	FamilySymbol^ familySymbol
)
member GetSketchGalleryOptions :
        familySymbol : FamilySymbol -> IList<SketchGalleryOptions>
Parameters
familySymbol FamilySymbol
 The family symbol.
Return Value
IList<SketchGalleryOptions>
 The valid list of SketchGalleryOptions.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace